src/cf/Catalogs/СправочникДляПроверкиСистемыСложносочиненногоВерсионирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>СправочникДляПроверкиСистемыСложносочиненногоВерсионирования</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/РегистрСведенийДляПроверкиСистемыСложносочиненногоВерсионирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>РегистрСведенийДляПроверкиСистемыСложносочиненногоВерсионирования</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ресурс1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ресурс2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ресурс3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Измерение1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СправочникДляПроверкиСистемыСложносочиненногоВерсионирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Измерение2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/СправочникДляПроверкиСистемыСложносочиненногоВерсионирования/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Автор: Карло И.В., 22.04.2021
	// Описание: Запись версии сложносочинённого объекта. 		
	//
	ВерсионированиеСложносочинённыхОбъектов.ЗаписатьВерсиюОбъекта(ЭтотОбъект, ТекущийОбъект);
	//
	// ...И.В.		
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	РегистрСведенийДляПроверкиСистемыСложносочиненногоВерсионирования.Измерение1 КАК Измерение1,
	                      |	РегистрСведенийДляПроверкиСистемыСложносочиненногоВерсионирования.Измерение2 КАК Измерение2,
	                      |	РегистрСведенийДляПроверкиСистемыСложносочиненногоВерсионирования.Ресурс1 КАК Ресурс1,
	                      |	РегистрСведенийДляПроверкиСистемыСложносочиненногоВерсионирования.Ресурс2 КАК Ресурс2,
	                      |	РегистрСведенийДляПроверкиСистемыСложносочиненногоВерсионирования.Ресурс3 КАК Ресурс3
	                      |ИЗ
	                      |	РегистрСведений.РегистрСведенийДляПроверкиСистемыСложносочиненногоВерсионирования КАК РегистрСведенийДляПроверкиСистемыСложносочиненногоВерсионирования
	                      |ГДЕ
	                      |	РегистрСведенийДляПроверкиСистемыСложносочиненногоВерсионирования.Измерение1 = &Измерение1");	
	Запрос.УстановитьПараметр("Измерение1", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		НоваяСтрока = Таблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	НаборЗаписей = РегистрыСведений.РегистрСведенийДляПроверкиСистемыСложносочиненногоВерсионирования.СоздатьНаборЗаписей();
	Для Каждого СтрокаТаблицы Из Таблица Цикл 
		НоваяЗапись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаТаблицы);
		НоваяЗапись.Измерение1 = Объект.Ссылка;
	КонецЦикла;
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры
